src/samples/generateCashRegisterTestDataRequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:api="http://schemas.nav.gov.hu/OPF/1.0/api"
	xmlns:com="http://schemas.nav.gov.hu/NTCA/1.0/common">
   <soap:Header/>
   <soap:Body>
      <api:GenerateCashRegisterTestDataRequest>
         <com:header>
            <com:requestId>5176453524</com:requestId>
            <com:timestamp>2022-02-06T13:49:17Z</com:timestamp>
            <com:requestVersion>1.0</com:requestVersion>
            <!--Optional:-->
            <com:headerVersion>1.0</com:headerVersion>
         </com:header>
         <com:user>
            <com:login>lwilsmn0uqert6u</com:login>
            <com:passwordHash cryptoType="SHA-512">2F43840A882CFDB7DB0FEC07D419D030D864B47B6B541DC280EF81B937B7A176E33C052B0D26638CC18A7A2C08D8D311733078A774BF43F6CA57FE8CD74DC28E</com:passwordHash>
            <com:taxNumber>12345678</com:taxNumber>
            <com:requestSignature cryptoType="SHA3-512">43D982BC2F0B43EB3A0B762EBB0CE5FCE5768345FF49F0244F50811BDF219079042FBF397EEA3BB8F0CBE1E327DE5F6B1200846586E423D82CDC515238EB325D</com:requestSignature>
            <!--<signKey>ac-ac3a-7f661bff7d342N43CYX4U9FG</signKey>-->
         </com:user>
         <api:software>
            <api:softwareId>123456789123456789</api:softwareId>
            <api:softwareName>string</api:softwareName>
            <api:softwareOperation>LOCAL_SOFTWARE</api:softwareOperation>
            <api:softwareMainVersion>string</api:softwareMainVersion>
            <api:softwareDevName>string</api:softwareDevName>
            <api:softwareDevContact>string</api:softwareDevContact>
            <api:softwareDevCountryCode>HU</api:softwareDevCountryCode>
            <api:softwareDevTaxNumber>string</api:softwareDevTaxNumber>
         </api:software>
         <api:generateCashRegisterTestDataParameter>
            <api:APNumber>A12345678</api:APNumber>
         </api:generateCashRegisterTestDataParameter>
      </api:GenerateCashRegisterTestDataRequest>
   </soap:Body>
</soap:Envelope>